{
    "id": "2025-09-20-watches-are-for-the-poor",
    "title": "Watches are for the poor",
    "description": "Why watches were never just ornaments or tools—they were chains keeping workers' eyes on the clock while owners looked at calendars and forecasts.",
    "date": "2025-09-20",
    "tags": [
        "philosophy",
        "technology",
        "random"
    ],
    "author": "Prajyoth Reddy",
    "readTime": 7,
    "published": true,
    "allowComments": true,
    "content": "# Watches are for the poor\n\nThat's an outright rude statement to say when there are many luxury watch brands like Patek Philippe, Rolex, Panerai, Hublot and more. Even I thought watches were a symbol of luxury until a weird thought came into my mind.\n\nI was drinking water and just wanted to know the date urgently. With water in my mouth, I immediately locked eyes with my 80-year-old grandma and signed to her by pointing at my arm with my index finger. She told me the time casually and moved on. But unknowingly, my brain entered that deep-think mode like a Large Language Model by then. I was wondering—what sign would I use to know the date? Why is the watch a symbol of time? Why isn't there a watch for the date? I know watches have dates, but they are not the main character. A watch is a device built with 3 spikes rotating at different speeds to quantify and display time in different notations.\n\n## The Question That Started It All\n\nThen I thought, why a watch? I can look outside anytime—the sky, the sun setting—and say, yeah, it must be 5. It's almost afternoon now, or it's early morning. But I can't, in any way, without an external source of information, say today is the 20th of September—pinpoint exact. Impossible! At least for me.\n\nThen why was knowing the time more important than knowing the date? There must be some reason. Then it struck me—almost like lightning in the middle of September clouds. **Industrialization it is!**\n\n## The Factory Worker's Reality\n\n> I'm a man who needs to feed his wife and kids. Who cares what day it is? I hope it's a good day! I hope I don't die in an accident at the factory, or maybe win a lottery. I wake up around 7 AM, take the bus at 8, reach by 8:50, factory gates open at 9, I get in. I haven't had breakfast in the morning, when's the lunch? That's the bell! It must be 12! Time for lunch. I'm feeling tired, there comes the bell! It's 6 PM now. Yeah, I can get out of this hell! I need to rush now, catch the bus at 6:15 to reach home by time for dinner.\n\nA worker in a factory has little chance of looking at the open sky and inferring it must be evening. Not his fault. Something like a wristwatch is definitely useful for someone like that. What would he do with a wrist calendar when there weren't even labor laws mandating holidays back then? Labor laws regulating hours/holidays came gradually from late 19th to early 20th century. *Even as a kid, I believed a calendar's only purpose was to show me how many days I was from Sunday.* Bells and watches are still used for the same purpose even now.\n\n## The Rich and the Bigger Picture\n\nBut me, in my deep-think mode, couldn't pause there. The rich used them too, right? What's something a giant company's chairman is waiting for? Everything can happen in a snap for him, right? Maybe this was just passed down as a virtue so that everyone under him uses one, making the organization punctual. Makes sense! But what does _he_ wait for then? That's when the bigger picture came to my mind.\n\n## The Pyramid of Time\n\n- A factory girl at a textile mill was paid by the hour.\n- A bricklayer got paid by the end of the day.\n- A shipbuilder or a railway engineer might be on a weekly wage.\n- A manager was on a monthly salary.\n- A chief or head of department got his revenue justified by the end of quarters.\n- A founder or an investor never counted in hours. They thought and planned in years and profits.\n\nLooking at this pyramid, we can infer what each used as a tool for measuring time. The lower down the ladder, the smaller the unit of time you could afford to think. The higher up, the longer the horizon—and the less a watch was a tool, and more an ornament to style.\n\n*Watches and time-books < Calendars and day-books < Attendance records and ledgers < Account books and payrolls < Reports, financial statements, and forecast charts*\n\n## The Real Purpose of Watches\n\nSo maybe watches were never just ornaments or tools. Maybe they were chains—keeping the worker's eyes on the clock while the owners looked at calendars, ledgers, and forecasts.\n\nThe poor were made to think in hours. The rich thought in years. And that's how power separated itself.\n\n## Today's Pyramid\n\nToday, watches are luxury, calendars are apps, and forecasts are slides on a lazer projector. The pyramid of time hasn't disappeared—it just turned into KPIs, OKRs, and quarterly reports.\n\nThe smartest move isn't to keep climbing the hours—it's to switch the unit of time you think in. Maybe the real flex was never the Rolex—it's the ability to decide which unit of time you choose to live by.",
    "metadata": {
        "created": "2025-09-20T12:00:00Z",
        "updated": "2025-09-20T12:00:00Z"
    }
}